app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)
    return render :new if params[:button] == "back"

    if @order.save
---
INSERT INTO "orders" ("name", "created_at", "updated_at", "email", "telephone", "delivery_address") VALUES (?, ?, ?, ?, ?, ?)

  def complete
    @order = Order.find_by(id: session[:order_id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]